install.packages("jiebaR")
library('jiebaRD')
library('jiebaR')
library(readxl)

# 導入數據
company <- read_excel("query_hive_5538.xlsx")
wk= worker()  #wk= worker(bylines = TRUE) 分段分詞

#分詞
words<- segment(company$company_name,wk)

#过滤掉1个字的词
words<- subset(words,nchar(as.character(words))>1)

# 計算詞頻
# test.freq =table(unlist(test))
word.freq = freq(words) #<- table(unlist(test))
#test.freq = freq(unlist(test))#<- table(unlist(test))
#test.freg= test.freq[order(-test.freq)]

#过滤掉特定條件
nono<-c('公司','有限公司','有限责任','分公司','实业公司','jingdiejn','chengpu','qiyu','shanxiang','ruiwen','jindi','jinhong','leichi',
        'jinchuang','ynsw','yingyao','chuangyou','benyi','jiuyi','diejin','pntest','nrsm','ydzq','tianqi','baodiesh')

city<- grep('市',word.freq$char, value = T)
county<- grep('县',word.freq$char, value = T)
province<- grep('省',word.freq$char, value = T)
area<-grep('区',word.freq$char, value = T)


china_area<-c(
  '北京','天津','上海','重庆',
  '河北','石家庄','保定','张家口','承德','唐山','秦皇岛','邢台','沧州','衡水','邯郸','廊坊',
  '山西','太原','大同','朔州','阳泉','长治','晋城','忻州','晋中','临汾','运城','吕梁',
  '内蒙古','呼和浩特','包头','乌海','赤峰','通辽','呼伦贝尔','鄂尔多斯','乌兰察布','巴彦淖尔','锡林郭勒','阿拉善','兴安',
  '辽宁','沈阳','大连','锦州','抚顺','本溪','铁岭','辽阳','朝阳','鞍山','丹东','营口','盘锦','葫芦岛','阜新',
  '吉林','长春','白城','松原','通化','辽源','四平','白山','延边',
  '黑龙江','哈尔滨','齐齐哈尔','黑河','大庆','伊春','鹤岗','佳木斯','双鸭山','七台河','鸡西','牡丹江','绥化',
  '江苏','南京','苏州','扬州','徐州','泰州','常州','宿迁','淮安','连云港','南通','镇江','无锡','盐城',
  '浙江','杭州','绍兴','宁波','湖州','衢州','台州','温州','嘉兴','金华','舟山','丽水',
  '安徽','合肥','安庆','宿州','阜阳','淮南','淮北','毫州','蚌埠','六安','宣城','池州','滁州','马鞍山','黄山','铜陵','芜湖','巢湖',
  '福建','福州','厦门','泉州','漳州','三明','莆田','龙岩','南平','宁德',
  '江西','南昌','九江','鹰潭','赣州','新余','上饶','景德镇','宜春','抚州','吉安','萍乡',
  '山东','济南','青岛','淄博','枣庄','东营','潍坊','烟台','济宁','泰安','威海','日照','莱芜','德州','临沂','聊城','滨州','荷泽',
  '河南','郑州','开封','洛阳','焦作','鹤壁','新乡','安阳','濮阳','许昌','漯河','南阳','商丘','信阳','周口','平顶山','三门峡','驻马店',
  '湖北','武汉','黄石','十堰','宜昌','荆州','襄樊','荆门','鄂州','孝感','黄冈','咸宁','随州',
  '湖南','长沙','株洲','湘潭','衡阳','邵阳','岳阳','益阳','郴州','永州','常德','怀化','娄底','张家界',
  '广东','广州','深圳','珠海','汕头','韶关','河源','梅州','惠州','汕尾','东莞','中山','江门','佛山','阳江','湛江','茂名','肇庆','清远','云浮','潮州','揭阳',
  '广西','南宁','桂林','柳州','梧州','钦州','贺州','北海','贵港','玉林','河池','来宾','崇左','防城港',
  '海南','海口','三亚','三沙',
  '四川','成都','自贡','德阳','泸州','绵阳','内江','广元','遂宁','乐山','南充','宜宾','广安','达州','巴中','雅安','眉山','资阳','攀枝花','绵竹','资阳','阿坝藏族','甘孜','凉山',
  '贵州','贵阳','遵义','安顺','六盘水','毕节地区','铜仁地区','黔西南州','黔东南州','黔南州',
  '云南','昆明','曲靖','玉溪','保山','昭通','丽江','思茅','临沧',
  '西藏','拉萨','昌都地区','林芝地区','山南地区','日喀则地区','那曲地区','阿里地区',
  '陕西','西安','宝鸡','咸阳','铜川','渭南','延安','汉中','榆林','安康','商洛',
  '甘肃','兰州','金昌','白银','天水','武威','张掖','庆阳','平凉','定西','陇南','嘉峪关','酒泉','临夏','甘南',
  '青海','西宁','海东','海西','海南','海北','黄南','果洛','玉树','新疆')


other_area<-c(
  '中国','长江','北方','山区','西南','中海','东南','南海','城镇','蓬江区','海外','葫芦岛','台湾','古冶区','华夏',
  '乌鲁木齐','宁夏','前海','襄阳','义乌','长兴','南海','柯桥区','银川','顺德','广西南宁','北京华','香港','滨海',
  '大理','吴江','双江','鄞州','四海','兴达','丹阳','永安','巴州','金泰','大唐','湖南华','镇海','英国')

# test_1=subset(word.freq,char != '有限公司'& char != '上海')
# test_2=with(word.freq,word.freq[which(char %in% c('有限公司','上海')),])
# 在iris数据集里，筛选Species字段，以sa结尾的行。subset(iris,grepl('sa$',Species))

word.freq=subset(word.freq,!(char %in% nono) & !(char %in% city) & !(char %in% county) & !(char %in% province) & !(char %in% area)
                 &!(char %in% china_area) &!(char %in% other_area)
                 )

#按词频过滤词，过滤掉只出现过一次的词，这里可以根据需要调整过滤的词频数
word.freq_2=subset(word.freq, word.freq$freq>=2)

#频数排序(*大 到 小用"-")
    # R软件中排序:sort(),rank(),order()
word.freq_2= word.freq_2[order(-word.freq_2$freq),]


#  company_tech<-subset(company,grepl('互联网',fname))
# segment(慈溪市市场监督管理局宗汉市场监管所,wk)



# 詞彙頻率圖
library(ggplot2)

word.freq_2_top50 <- head(word.freq_2,50) #取前50个词
word.freq_2_top150 <- head(word.freq_2,150) #取前150个词
word.freq_2_top200 <- head(word.freq_2,200) #取前200个词
word.freq_2_top300 <- head(word.freq_2,300) #取前300个词

ggplot(word.freq_2_top50, aes(x=reorder(char,-freq), y=freq)) 
        + geom_bar(stat="identity", fill="lightblue", colour="black")
        +geom_text(aes(label=freq), vjust=-0.2)
        +theme(axis.text.x = element_text(angle = 45, hjust = 0.5, vjust = 0.5))


# 文字雲
library(wordcloud)
library(wordcloud2)

wordcloud2(word.freq_2_top300 #word.freq_2[3:200,])
          ,size = 2,color = 'random-dark', backgroundColor = "white",fontFamily = "微软雅黑")


#對原字段進行關鍵詞歸類
company_0524<-within(company_0524,{
    cat_name<-NA                          
    cat_name[company_0524$fname %in% type1]<-'交通物流类'
    cat_name[company_0524$fname %in% type2]<-'工业制品类'
    cat_name[company_0524$fname %in% type3]<-'建筑房地产'
    cat_name[company_0524$fname %in% type4]<-'咨询服务类'
    cat_name[company_0524$fname %in% type5]<-'工程环保类'
    cat_name[company_0524$fname %in% type6]<-'IT互联网类'
    cat_name[company_0524$fname %in% type7]<-'劳务服务类'
    cat_name[company_0524$fname %in% type8]<-'建材家装类'
    cat_name[company_0524$fname %in% type9]<-'教育艺术类'
    cat_name[company_0524$fname %in% type10]<-'材料加工类'
    cat_name[company_0524$fname %in% type11]<-'餐饮住宿类'
    cat_name[company_0524$fname %in% type12]<-'医疗保健类'
    cat_name[company_0524$fname %in% type13]<-'能源化工类'
    cat_name[company_0524$fname %in% type14]<-'汽车汽配类'
    cat_name[company_0524$fname %in% type15]<-'工业服务类'
    cat_name[company_0524$fname %in% type16]<-'金融服务类'
    cat_name[company_0524$fname %in% type17]<-'广告传媒类'
    cat_name[company_0524$fname %in% type18]<-'工业原料类'
    cat_name[company_0524$fname %in% type19]<-'农业农资类'
    cat_name[company_0524$fname %in% type20]<-'公用事业类'
    cat_name[company_0524$fname %in% type21]<-'生鲜食品类'
    cat_name[company_0524$fname %in% type22]<-'服装配饰类'
    cat_name[company_0524$fname %in% type23]<-'生活服务类'
    cat_name[company_0524$fname %in% type24]<-'美妆宠物类'
    cat_name[company_0524$fname %in% type25]<-'政府机构类'
    cat_name[company_0524$fname %in% type26]<-'日用百货类'
    cat_name[company_0524$fname %in% type27]<-'母婴玩具类'
    cat_name[company_0524$fname %in% type28]<-'电脑办公类'
    cat_name[company_0524$fname %in% type29]<-'运动休闲类'
    cat_name[company_0524$fname %in% type30]<-'庆典礼品类'
    cat_name[company_0524$fname %in% type31]<-'商超百货类'
    }
   )

write.xlsx(company_0524,"20190524_company_R.xlsx")





#交通物流类
type1<-grep('报关|仓储|仓库|船舶|
船务|电商|电子商务|对外贸易|钢铁贸易|港口|工贸|公共交通|供应链|国际贸易|国际商贸|海运|航空|航运|货物运输|货运|集装箱|集装箱运输|交通|交通运输|进出口|进口|经贸|科贸|跨境|快递|冷冻|冷链|贸易|木工机械|配送|速递|天津港|外贸|物流|物流配送|物资|物资供应|物资贸易|运输|中国邮政',company_0524$fname ,value=T)

#工业制品类
type2<-grep('安防|保温材料|爆破|泵业|变压器|不锈钢管|测绘|测控|成套设备|齿轮|传动|传感器|弹簧|刀具|灯光音响|灯具|灯具厂|电磁|电动工具|电工材料|电机|电机厂|电缆|电力设备|电气|电气设备|电器厂|电器配件|电器设备|电梯|电线电缆|电源|电子|电子产品|电子电器|电子技术|电子器材|电子设备|电子系统|电子仪器|电子元件|电子制品|动力|动力机械|发电设备|发动机|阀门|阀门厂|防护用品|防水|防水材料|纺织机械|干燥设备|钢管|工程机械|工具|工业气体|工业用品|供电|管道|管件|管业|管桩|光伏|光学|锅炉|焊接设备|化工机械|环境设备|换热器|活性炭|货架|机车|机床|机电|机电设备|机器|机械|机械厂|机械工业|机械加工|机械设备|机械制造|激光|技术设备|建筑机械|建筑设备|交通设施|胶粘制品|脚手架|金属结构|紧固件|精密|精密机械|精密仪器|净化|净水|绝缘材料|科学仪器|空压机|矿山机械|矿山设备|劳保|劳保用品|连接器|粮油机械|零部件|密封材料|暖通|起重|起重机|起重机械|器材|器械|清洁用品|燃气设备|热能设备|人防|设备|设备厂|声学|石油机械|输配电|数控|数控机床|数控机械|水泵|塑胶五金|塑料五金|特种设备|通风设备|通用设备|微电子|五交化|五金|五金店|五金工具|五金机械|五金建材|五金交电|五金配件|五金制品|线缆|消防|消防安全|消防器材|消防设备|消防设施|修理厂|压缩机|压铸|研磨|液压|液压件|仪表|仪器|仪器设备|仪器仪表|音响|油漆|预制构件|元件|照明|照明灯|真空|真空设备|制冷|智能仪表|中央空调|重工|轴承|装备|装卸|自动化|自动控制|自动门|自控',company_0524$fname ,value=T)

#建筑房地产
type3<-grep('不动产|城建|地产|房产|房地产|房屋|房屋中介|混凝土|建工|建设|建设工程|建业|建筑|建筑工程|建筑设计|水泥|土地|土石方|智能建筑|置业|砖厂',company_0524$fname ,value=T)

#咨询服务类
type4<-grep('财税|财务|财务顾问|财务管理|财务会计|财务咨询|法律咨询|工商代理|工商登记|会计|会计代理|会计公司|会计核算|会计师|记帐|记账|律师|企业顾问|认证咨询|事务管理|事务所|税务|税务代理|税务师|心理咨询|账本|账房|知识产权|咨询|咨询服务',company_0524$fname ,value=T)

#工程环保类
type5<-grep('产业园|道路|电力工程|电气工程|吊装|防水工程|废旧金属|废旧物资|孵化器|钢构|钢结构|工程|工程顾问|工程技术|工程建设|工程局|工程设计|工程项目|工程造价|工程质量|公路|公路工程|供排水|古建筑|管道工程|广场|规划设计|轨道交通|海洋工程|环境|环境工程|环境景观|环境卫生|环境治理|环卫|回收|机电工程|机械工程|监理|建筑节能|搅拌|节水|景观|景观规划|景观设计|空间设计|垃圾处理|垃圾清运|路桥|绿化|桥梁|桥梁工程|热处理|人造草坪|砂浆|砂石|生态环境|生态园林|生物防治|生物工程|水电工程|水利工程|水利建设|隧道|铁路工程|土建工程|土木工程|污水|污水处理|系统工程|项目管理|消防工程|预应力|园林|园林工程|园林景观|园林绿化|园林设计|园艺|再生资源|造价|渣土|招标',company_0524$fname ,value=T)

#IT互联网类
type6<-grep('网络|半导体|半导体技术|地理信息|电脑|电脑城|电脑软件|电信服务|电子科技|电子信息|管理软件|互联网|机器人|集成电路|计算机|计算机技术|计算机软件|计算机系统|计算机信息|空间信息|人工智能|软件|软件工程|软件技术|软件开发|数据|数据服务|数据管理|通信|通信工程|通讯|通讯器材|通讯设备|网络工程|网络科技|网络通信|系统集成|线路板|信息|信息工程|信息管理|信息技术|中国电信|中国移动通信集团|电信',company_0524$fname ,value=T)

# 劳务服务类
type7<-grep('保安|保险|保险代理|保险经纪|殡葬|策划|产品设计|创意设计|代理|代理服务|担保|档案管理|登记|典当|分包|服务站|服装设计|国际展览|会馆|会展|家居设计|家政|金融服务|经纪|劳务|拍卖|派遣|品牌设计|评估|企业形象|人才|人力|人力资源|商标代理|设计|室内设计|托管|外包|物业|物业管理|形象设计|营销策划|运营|招投标|照明设计|租赁',company_0524$fname ,value=T)

# 建材家装类
type8<-grep('板材|餐具|厨房设备|厨房用品|厨具|厨卫|窗饰|瓷砖|灯饰|电器|电器店|钢材|红木家具|家电|家居|家居饰品|家居用品|家居装饰|家具|家具厂|家具城|家具店|家私厂|家用电器|建材|建材厂|建材城|建材装饰|建筑材料|建筑装修|洁具|空调|门窗|门窗厂|门业|木家具|木门|幕墙|耐火材料|墙体|人造板|软装|数字电视|涂装|卫浴|新型建材|智能家居|装潢|装璜|装饰|装修',company_0524$fname ,value=T)

# 教育艺术类
type9<-grep('电影|电影城|电影院线|动漫|歌厅|教学设备|教育|科教|培训|培训中心|体育|体育产业|体育器材|体育设施|体育用品|卫视|文化|文化产业|文化教育|文化用品|文化娱乐|文体用品|休闲|艺术|艺术创作|艺术交流|艺术设计|音乐|影城|影视城|影视文化|影视制作|影业|影院|娱乐|展览|职业技能|职业培训|中视|足球',company_0524$fname ,value=T)

# 材料加工类
type10<-grep('玻璃|玻璃钢|玻璃制品|不锈钢|彩塑|电子厂|锻造|锻造厂|发制品|纺织品|复合材料|钢化玻璃|钢业|钢制品|硅橡胶|焊接|合金|化纤|化学|加工厂|加工场|金属|金属加工|金属制品|金属制造|铝制品|木器|木业|木制品|配件厂|皮草|皮革|皮革制品|皮具|乳胶制品|石材|石材厂|石业|水泥制品|塑化|塑胶|塑胶厂|塑胶制品|塑料|塑料厂|塑料制品|塑业|塑制品|陶瓷|五金厂|五金塑料|纤维制品|橡胶|橡胶制品|橡塑|新型材料|羽绒制品|纸品|纸业|纸制品|制品|制品厂|制造|竹木|竹业|铸造厂',company_0524$fname ,value=T)

# 餐饮住宿类
type11<-grep('宾馆|菜馆|餐馆|餐厅|餐饮|餐饮公司|餐饮企业|茶餐厅|大酒店|饭店|公寓|火锅|火锅城|火锅店|假日酒店|酒吧|酒店|酒店设备|酒店用品|酒馆|快餐店|快捷酒店|料理店|旅行社|旅业|旅游|美食|美食城|票务|膳食|商旅|商务酒店|生态旅游|西餐厅|小吃店|艺术品|饮食文化|中国旅行社|自助餐厅',company_0524$fname ,value=T)

# 医疗保健类
type12<-grep('保健|保健品|保健食品|国药|护理|健康|矫形器|康复中心|口腔|口腔医院|口腔诊所|门诊|生物|生物科技|生物医学|生物医药|生物制品|卫生用品|眼镜|药材|药店|药房|药品|药业|医疗|医疗器械|医学|医药|医用|诊所|制药|制药机械|中草药|中西医|中药材|中药饮片|中医|中医药|中医医院|中医院',company_0524$fname ,value=T)

# 能源化工类
type13<-grep('磁电|电力|电业|电站|光电|核工业|化工|化工产品|化工厂|化工设备|化工原料|化学品|加油站|节能|沥青|煤炭|煤业|能源|能源管理|能源技术|能源开发|燃料|燃料油|热能|生物化工|生物质能|石化|石油|石油化工|石油气|石油设备|石油制品|太阳能|碳素|天然气|新能源|油品|再生能源|中石化',company_0524$fname ,value=T)

#  汽车汽配类
type14<-grep('车行|车辆配件|车业|出租汽车|电动车|二手车|房车|机动车|机动车辆|轮胎|名车|摩托车|汽车|汽车部件|汽车城|汽车电器|汽车空调|汽车贸易|汽车配件|汽车信息|汽车修理|汽车用品|汽车装饰|汽贸|汽配|汽修|汽修厂|润滑油|停车|停车场|无人机|修配厂|专用汽车|自行车',company_0524$fname ,value=T)

# 工业服务类
type15<-grep('包装|包装材料|包装厂|包装箱|标牌|彩印|彩印包装|彩印厂|电镀厂|防腐|防腐工程|纺织|纺织厂|纺织印染|服装辅料|硅业|盒子|化学试剂|检测|检测站|检修|检验|空调设备|拉链|铝箔|铝材|毛纺织|密封件|模具|模具厂|模具设计|模塑|磨料|轻纺城|热镀锌|丝绸|塑胶模具|塑料包装|添加剂|图文|涂料|涂料厂|维修厂|无纺布|洗涤|鞋材|绣品|印染|印染机械|印刷|印刷厂|印务|印业|印章|油墨|针纺|针纺织|针纺织品|针织|真空镀膜|织造|织造厂|纸箱包装|纸箱厂|助剂|财产保险',company_0524$fname ,value=T)

# 金融服务类
type16<-grep('财产保险|产权交易|创业投资|典当|股权|贵金属|基金|交易中心|金融信息|融资|投资|小额贷款|资产',company_0524$fname ,value=T)


# 广告传媒类
type17<-grep('传播|传媒|广告|广告设计|广告装饰|网络传媒|文化传媒|演艺',company_0524$fname ,value=T)

# 工业原料类
type18<-grep('材料|材料厂|采石场|磁性材料|钢厂|钢铁|高分子|工程塑料|光学材料|合金材料|金刚石|金矿业|金属材料|精细化工|矿产|矿产品|矿产资源|矿山|矿业|林木业|炉料|铝业|煤矿|纳米材料|耐磨材料|泡沫塑料|石场|石料|石料厂|石墨制品|石英砂|水晶|水泥厂|塑胶原料|碳纤维|陶瓷原料|特钢|特殊钢|铁合金|铜业|橡胶厂|冶金|冶金工业|冶炼|硬质合金|有机玻璃|有机硅|有色金属|造纸厂|中矿|铸造',company_0524$fname ,value=T)


# 农业农资类
type19<-grep('茶业|茶叶|畜牧|畜牧业|豆制品|果蔬|果业|果园|海产品|化肥|林业|苗木|木材|牧业|农产品|农场|农副产品|农林|农贸|农牧|农牧业|农业|农业机械|农业装备|农资|森林|生态|生态农业|食用菌|蔬菜|水产|水产品|饲料|饲料厂|屠宰场|现代农业|养殖|养殖场|渔具|渔业|园林机械|园艺场|原种场|远洋渔业|种养|种业|种植|种子',company_0524$fname ,value=T)

# 公用事业类
type20<-grep('创业园|电力公司|动物园|儿童医院|福利彩票|妇产医院|高级中学|高速公路|工业园|供水|环保|环境监测|火车站|科学城|门诊部|气体|燃气|商业银行|设计院|社会福利|社会工作|生态园|实验室|水电|水电站|水利水电|水务|铁路|学校|学院|眼科医院|养老|液化气|医院|幼儿园|支行|中国农业银行|中国人民银行|中铁|中心小学|自来水|自来水厂',company_0524$fname ,value=T)


# 生鲜食品类
type21<-grep('菜篮子|餐饮店|茶厂|茶文化|茶叶店|副食|副食店|副食品|海鲜|红酒|机械配件|酒类|酒业|酒庄|咖啡|矿泉水|粮食|粮油|粮油食品|米业|啤酒|葡萄酒|泉水|乳业|生鲜|食材|食品|食品厂|食品店|食品工业|食品科技|食品饮料|水果店|调味品|鲜生|鲜食|盐业|饮料|饮品|饮食|饮用水',company_0524$fname ,value=T)


# 服装配饰类
type22<-grep('服饰|服饰店|服装|服装厂|服装店|服装服饰|服装贸易|民族服饰|时装|饰品|饰品厂|饰品店|首饰|箱包|鞋业|眼镜店|玉器|制衣|钟表|珠宝|珠宝店|珠宝首饰|专卖店|钻石',company_0524$fname ,value=T)

# 生活服务类
type23<-grep('安装|保洁|建筑安装|救援|理发店|清洁|维修|维修服务|维修中心|洗衣',company_0524$fname ,value=T)

# 美妆宠物类
type24<-grep('宠物|宠物用品|动物|化妆品|美容|美容店|美容美发|美容中心|日化|养护|整形',company_0524$fname ,value=T)

# 政府机构类
type25<-grep('城乡规划|城乡建设|出入境|公证处|管理局|海洋|机关|建设局|交通局|勘测|勘察|林业局|流体|人民政府|土地规划|委员会|岩土|研究所|研究院|指挥部|中核',company_0524$fname ,value=T)


# 日用百货类
type26<-grep('百货|百货店|供销|经销处|经销店|贸易商行|日用百货|日用品|商店|商行|用品店',company_0524$fname ,value=T)

# 母婴玩具类
type27<-grep('宝贝|儿童|儿童用品|乐器|母婴|伞业|图书|玩具|玩具厂|音像|婴儿|婴儿用品|婴童|婴幼儿|智力开发',company_0524$fname ,value=T)


# 电脑办公类
type28<-grep('办公|办公设备|办公用品|数码|数码产品|数码科技|文具',company_0524$fname ,value=T)

# 运动休闲类
type29<-grep('度假|度假村|高尔夫|户外用品|户外运动|健身|健身器材|洗浴|娱乐城|娱乐中心|运动|运动器材|运动用品|足浴',company_0524$fname ,value=T)


# 庆典礼品类
type30<-grep('工艺礼品|工艺品|工艺品厂|工艺制品|花卉|礼品|烟花爆竹|爆竹|烟花',company_0524$fname ,value=T)

# 商超百货类
type31<-grep('百货商场|便利店|供销社|购物广场|购物中心|连锁店|批发城|商场|商城|商贸城|商业广场|生活用品|手机店|用品商店',company_0524$fname ,value=T)

